Revit 2026 API

# GradientGradientInterpolation Property

---

The property labeled "Interpolation" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientInterpolation { get; }
```
```vb
Public Shared ReadOnly Property GradientInterpolation As String
	Get
```
```cpp
public:
static property String^ GradientInterpolation {
	String^ get ();
}
```
```fsharp
static member GradientInterpolation : string with get
```

#### Property Value

String

This property is a "AssetPropertyList" of type "AssetPropertyInteger".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace